import React from "react";
import { Navbar } from "../Navbar";
import navStyles from "../About/AboutUs.module.css";
import { logo_blue } from "../utils/svg";
import styles from "./Articles.module.css";
import photo1 from "./Articles-images/photo7.png"
import photo2 from "./Articles-images/photo8.png"
import Footer from "../Home/Footer";
import vector from "../About/About-images/Vector.png"

const SingleArticle = ({active, setActive}) => {
  return (
    <>
      <Navbar styles={navStyles} logo={logo_blue} active={active} setActive={setActive} vector={vector}/>
      <main className={styles.single_artcl}>
        <div className={styles.arrow_links}>
          <span>MOXXXY {">"} </span>
          <span>Статті {">"} </span>
          <span className={styles.bold_link}>
            Найкращі проекти міських будинків
          </span>
        </div>
        <h1>Найкращі проекти заміських будинків</h1>
        <img src={photo1} alt="" />
        <p>
          До будь-якої житлової будівлі пред'являються особливі вимоги.
          Заміський будинок повинен бути не тільки надійно збудований, але й
          мати привабливий екстер'єр. Кожен власник нерухомості мріє, щоб його
          житло виглядало колоритно, водночас відповідаючи сучасним тенденціям
          та смаку мешканців. Поєднати це можуть лише професіонали. <br />
          <br />
          Архітектурна компанія MOXXXY пропонує ознайомитися з найкращими
          проектами заміських будинків, розробленими нашими фахівцями. Вони
          зведені за індивідуальним дизайном та мають статус ексклюзивних.
          Оригінальний естетичний зовнішній вигляд повною мірою поєднується з
          продуманим плануванням, ергономічністю та надійністю.
          <br />
          <br />
          Ми розробимо вам авторський проект, з урахуванням всіх побажань, вимог
          безпеки та інших нормативів. Також можливе внесення змін до готових,
          типових зразків, що достатньо втілить усі ваші сміливі мрії, і при
          цьому обійдеться недорого.
          <br />
          <br />
          <span className={styles.bold_text}>Важлвиві моменти</span>
          <br /> Бажаєте гарний і водночас функціональний будинок, - звертайтесь
          до компетентної компанії. Наші архітектори, дизайнери, інженери та
          інші співробітники мають величезний досвід та достатні знання, щоб
          створити стильний, неповторний проект, що відповідає вимогам безпеки
          та практичності.
          <br />
          <br />
          Для цього враховується безліч деталей:
          <br />
          <br />
          <span>Зовнішній вигляд</span> <br />
          Будинок починається з оточення: затишний дворик та акуратний газон,
          цікаво декорований фасад, солідні двері та інші елементи екстер'єру
          впливають на настрій та сприйняття. Тому ми приділяємо особливу увагу
          кожній дрібниці та прикладаємо максимум зусиль, щоб ще до входу в
          будинок створювалося приємне враження.
          <br />
          <br />
          Оточення Створюючи антураж, ми обов'язково враховуємо загальну
          архітектурну подобу, щоб ваша нерухомість не тільки ефектно виглядала,
          але гармонійно вписалася в навколишній простір. Тому наше бюро
          розробляє проекти в сучасній стилістиці - динамічні, виразні, що
          відображають індивідуальний смак власника, але при цьому досить
          універсальні для того, щоб скласти оргаїчну картину із сусідніми
          будівлями.
          <br />
          <br />
          <span>Довговічність</span>
          <br /> Проект гарного будинку чи котеджу потребує продуманої
          реалізації. Щоб споруда залишалася всередині та зовні привабливою та
          функціональною, необхідно використовувати першокласні матеріали,
          залучати надійних фахівців та виконувати роботи з актуальних
          технологій. Наші проекти довговічні саме тому, що це дотримується
          100%. Монолітний фундамент, звукопоглинаючі стіни, енергоефективне
          утеплення, бездоганні комунікації, грамотне планування – це і багато
          іншого передбачено в кожному будинку. Завдяки цьому внутрішній простір
          та екстер'єрні рішення довгі роки тішать мешканців.
        </p>
        <img src={photo2} alt="" />
        <p>
          <span className={styles.bold_text}>Чому вибирають MOXXXY?</span><br/>
          Ми пропонуємо оптимальне співвідношення вартості послуг та якість
          виконання. Телефонуйте, залишайте заявки і переконайтеся самі. Разом з
          нашими фахівцями ви обов'язково оберете той варіант, який відповідає
          вашим уявленням про ідеал.
          <br />
          <br /> На нашому сайті ви знайдете найкращі проекти заміських
          будинків, фото та описи красивих будинків. Вивчайте варіанти
          комплектації, технічні та інші характеристики, розцінки, відгуки про
          нашу роботу. <br />
          <br />
          <span>Наші переваги в наступному:</span><br/><br/>
          <br />· Обслуговування за вищим розрядом;<br/> · Досвід та компетентність;<br/>
          · Виконання зобов'язань у своєчасний термін.
        </p>
      </main>
      <Footer/>
    </>
  );
};

export default SingleArticle;
