import React from "react";
import { Navbar } from "../Navbar";
import styles from "./AboutUs.module.css";
import { logo_blue } from "../utils/svg";
import photo from "./About-images/photo.png";
import photo2 from "./About-images/photo2.png";
import Footer from "../Home/Footer";
import vector from "./About-images/Vector.png"

const AboutUs = ({active, setActive}) => {
  return (
    <>
      <Navbar styles={styles} logo={logo_blue} vector={vector} active={active} setActive={setActive}/>
      <main className={styles.aboutus_block}>
        <h1 className={styles.about_title}>ЩО ТАКЕ MOXXXY</h1>
        <p className={styles.text}>
          <span className={styles.blueMoxy_in_text}>MOXXXY</span> – це стабільна
          компанія, яка динамічно розвивається та забезпечує надання високої
          якості послуг в будівельній галузі. Вже кілька років компанія
          являється членом Будівельної палати України.
          <br />
          <br /> Компанія працює на ринку нерухомості з 2004 року та має
          державну ліцензію на здійснення всього комплексу робіт, пов’язаних з
          будівництвом будівель і споруд у відповідності з державним стандартом.
          <br />
          <br />
          <span className={styles.blueMoxy_in_text}>MOXXXY</span> користується
          заслуженою довірою і високою репутацією серед клієнтів та партнерів,
          що досягнуто завдяки виконанню своїх зобов’язань перед клієнтами та
          партнерами, чітким дотриманням законодавства, наявністю потужної
          матеріально-технічної бази, висококваліфікованим керівникам, інженерам
          та робітникам різних спеціальностей.
        </p>
        <img className={styles.about_img} src={photo} alt="" />
        <p className={styles.text}>
          Професіоналізм, цілеспрямованість, відповідальність – головні складові
          загальної характеристики компанії.
          <br />
          <br /> Успішно розвиваючись в умовах зростаючої конкуренції на
          українському ринку нерухомості, ми постійно вдосконалюємо свій
          виробничий і технічний потенціал, використовуємо передові методи
          роботи.
          <br />
          <br /> За період діяльності компанією успішно реалізовано ряд проектів
          в сферах житлового, промислового, громадського будівництва, зокрема
          житлові будинки, приватні будинки, готельні комплекси, виробничі бази.
        </p>
        <img className={styles.about_img} src={photo2} alt="" />
        <p className={styles.text}>
          Спираючись на власні маркетингові дослідження, компанія оперативно
          реагує на постійно мінливий попит і пропонує споживачам продукт,
          відповідний їх очікуванням, а налагоджені зв’язки із партнерами,
          постачальниками, службами замовника-забудовника дозволяють пропонувати
          нашим клієнтам житло за доступними цінами і завжди забезпечувати здачу
          будинків в заплановані терміни. <br />
          <br /> Спектр пропонованого нами житла відповідає як державним
          стандартам так і вимогам покупця чи замовника та включає в себе
          будинки з квартирами підвищеної комфортності, а також проекти елітного
          житла, що дозволяє задовольнити потреби самих широких верств
          населення. <br />
          <br /> Завдяки наявній професійній матеріально-технічній базі,
          кваліфікованому персоналу, надійним партнерам та постачальникам ми
          досягаємо поставлених цілей та забезпечуємо будівництво якісного,
          сучасного комфортного житла та нежитлових об’єктів.
        </p>
        <Footer/>
      </main>
    </>
  );
};

export default AboutUs;
